AddressBook/src/main/resources/com/sijiang/webservice/soap/ws_definition/address_book.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
				  xmlns:tns="http://www.addressbook.com" 
				  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
				  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
				  name="address_book" 
				  targetNamespace="http://www.addressbook.com"
				  xmlns:open_account_request="http://www.addressbook.com/open_account"
				  xmlns:open_account_response="http://www.addressbook.com/open_account">
 
  <wsdl:types>
    <xsd:schema>
      <xsd:import namespace="http://www.addressbook.com/open_account"
      	schemaLocation="../message_format/OpenAccountRequest.xsd" />
      <xsd:import namespace="http://www.addressbook.com/open_account"
      	schemaLocation="../message_format/OpenAccountResponse.xsd" />	
    </xsd:schema>
  </wsdl:types>
  
  <wsdl:message name="OpenAccountRequest">
    <wsdl:part element="open_account_request:OpenAccountRequest" name="OpenAccountRequest"/>
  </wsdl:message>
  <wsdl:message name="OpenAccountResponse">
    <wsdl:part element="open_account_response:OpenAccountResponse" name="OpenAccountRequest"/>
  </wsdl:message>

  <wsdl:portType name="address_book">
    <wsdl:operation name="OpenAccount">
      <wsdl:input message="tns:OpenAccountRequest"/>
      <wsdl:output message="tns:OpenAccountResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  
  <wsdl:binding name="address_bookSOAP" type="tns:address_book">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="OpenAccount">
      <soap:operation soapAction=""/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  
  <wsdl:service name="address_book">
    <wsdl:port binding="tns:address_bookSOAP" name="address_bookSOAP">
      <soap:address location="http://www.addressbook.com"/>
    </wsdl:port>
  </wsdl:service>
  
</wsdl:definitions>
