AddressBook/target/classes/com/sijiang/webservice/soap/message_format/OpenAccountRequest.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
 			   xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
 			   xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	  <soap:Body>
		  <OpenAccountRequest xmlns="http://www.addressbook.com/open_account">
			  <username>string </username>
			  <passord>string </passord>
		  </OpenAccountRequest>
	  </soap:Body>
</soap:Envelope>